Revit 2027 API
StairsRun.ActualRisersNumber Property
 The actual number of stairs risers in the stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ActualRisersNumber { get; }
Public ReadOnly Property ActualRisersNumber As Integer
	Get
public:
property int ActualRisersNumber {
	int get ();
}
member ActualRisersNumber : int with get
Property Value
Int32
Remarks
 This is a read-only value.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace